import phonenumbers
from phonenumbers import geocoder, timezone
import pyttsx3
engine = pyttsx3.init()
engine.say("Hi welcom ty DaxBin!")
engine.runAndWait()
print("""_________________¶________________¶
_________________¶¶________________¶¶
_______________¶¶¶__________________¶¶¶
_____________¶¶¶¶____________________¶¶¶¶
____________¶¶¶¶¶____________________¶¶¶¶¶
___________¶¶¶¶¶______________________¶¶¶¶¶
__________¶¶¶¶¶¶______________________¶¶¶¶¶¶
__________¶¶¶¶¶¶¶__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶__¶¶¶¶¶¶¶
__________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
___________¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
____________¶¶¶¶¶¶¶¶____¶¶¶¶¶¶____¶¶¶¶¶¶¶¶
___¶________¶¶¶¶¶¶¶______¶¶¶¶______¶¶¶¶¶¶¶
___¶_______¶¶¶¶¶¶¶¶___O_¶¶¶¶¶__O__¶¶¶¶¶¶¶¶
__¶¶¶______¶¶¶¶¶¶¶¶¶____¶¶¶¶¶¶____¶¶¶¶¶¶¶¶¶
__¶¶¶_____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
_¶¶¶¶¶____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶__¶¶
_¶¶¶¶¶____¶¶¶__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶__¶¶¶
___¶¶_____¶¶¶__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶__¶¶¶
___¶¶______¶¶¶_____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_____¶¶
____¶¶______¶¶________¶¶¶¶¶¶¶¶¶¶_______¶¶
_____¶¶______¶¶¶_______________________¶
_____¶¶________¶¶____¶¶¶¶¶¶¶¶¶¶¶______¶
______¶¶________¶¶¶_____¶¶¶¶¶¶¶¶¶¶¶__¶
_______¶¶__________¶¶¶_____¶¶¶¶¶¶¶¶¶¶
_________¶¶___________¶¶¶¶¶__¶¶¶¶¶¶¶¶¶
_____________________________¶¶¶¶¶¶¶¶¶¶
______________________________¶¶¶¶¶¶¶¶¶
_______________________________¶¶¶¶¶¶¶""")

def get_phone_info(phone_number):
    try:
        parsed_number = phonenumbers.parse(phone_number)
        if phonenumbers.is_valid_number(parsed_number):
            region = geocoder.description_for_number(parsed_number, "ua" "ru")
            time_zone = timezone.time_zones_for_number(parsed_number)
            return f"Регион🕱: {region}\nЧасовой пояс✈: {time_zone[0]}"
        else:
            return "Неверный формат номера телефона✘."
    except phonenumbers.phonenumberutil.NumberParseException:
        return "Неверный формат номера телефона✘."

def main():
    print("■ Welcom DaxBin programms поиск по тел номеру ■")
    print("Введите 'exit' для выхода из программы.")

    while True:
        phone_number = input("Введите номер телефона в формате ✆ +380XXXXXXXXX: ")
        if phone_number.lower() == 'exit':
            break
        else:
            print("Отправка номера на обработку■...")
            info = get_phone_info(phone_number)
            print(info)

if __name__ == "__main__":
    main()
